import Binding


def main():
    # Выполняем команду выполнения задач из урока 1
    print('''
    Знакомство с языком Python (семинары)\n
        Урок 1. Знакомство с Python:
            - включает в себя 5 задач
        Урок 2. Знакомство с Python. Продолжение:
            - включает в себя 5 задач (последняя задача под №5 является дополнительной)
        Урок 3. Данные, функции и модули в Python
            - включает в себя 4 задачи''')
    Binding.UnitNumberTask()
# Запускаем главную функцию
main()
